# 内网DNS的部署与使用

> 本章节基于RHEL7系统讲述了内网DNS的部署与使用

## Author

```
Name:Shinefire
Blog:https://github.com/shine-fire/Ops_Notes
E-mail:shine_fire@outlook.com
```

## 一、DNS原理介绍

## 二、DNS Server部署

### 环境说明

| IP        | HOSTNAME      |
| --------- | ------------- |
| 10.1.1.21 | test.geeklp   |
| 10.1.1.23 | user.geeklp   |
|           |               |
| 10.1.1.23 | tomcat.geeklp |



### 2.1 安装DNS服务

#### 2.1.1 安装RPM包

```bash
[root@iscsi ~]# yum -y install bind bind-utils bind-chroot
```

#### 2.1.2 修改配置文件

将listen-on和allow-query这两行修改成any，对所有人开放

```bash
[root@iscsi etc]# vim /etc/named.conf 
listen-on port 53 { any; };
allow-query     { any; };
```

#### 2.1.3 启动服务

```bash
[root@iscsi etc]# systemctl start named
```

#### 2.1.4 配置防火墙，放行DNS

```bash
[root@Geeklp-DNS ~]# firewall-cmd --permanent --add-service=dns
[root@Geeklp-DNS ~]# firewall-cmd --reload
```

#### 2.1.5 测试

返回数据无异常表示初步配置完成。

```bash
[root@iscsi etc]# dig www.baidu.com @192.168.31.228
```

### 2.2 配置正向解析

### 2.2.1 新增需要解析的域

修改`named.rfc1912.zones`文件或者直接修改` named.conf `文件也可以，在文件的末尾加上下面的内容

```bash
[root@iscsi ~]# vim /etc/named.rfc1912.zones 
zone "shinefire.com" IN {
        type master;
        file "/var/named/data/shinefire.com.zone";
};
```

#### 创建域配置文件

域配置文件也可以复制模板文件，模板文件的位置：`/var/named/named.localhost`

```bash
[root@iscsi ~]# cd /var/named/data/
[root@iscsi data]# touch shinefire.com.zone 
[root@iscsi data]# vim shinefire.com.zone 
$TTL 1D
@       IN SOA  @ rname.invalid. (
                                        0       ; serial
                                        1D      ; refresh
                                        1H      ; retry
                                        1W      ; expire
                                        3H )    ; minimum
        NS      @
        A       127.0.0.1
        AAAA    ::1
rhvh-1  IN  A   192.168.31.227
```

**注意：**192.168.31.228后面的.不可以省略，否则报错

SOA是Start Of Authority（开始验证）的意思，与域有关，后面共会接7个参数，这7个参数的意义依次是： 

```tex
1> Master DNS 服务器主机名，即在这个域中哪个DNS作为主服务器，在本例中，即shinefire。
2> 管理员的Email。即出现问题可给管理员发邮件。在本例中，是admin.shinefire。
3> 序号。这个序号代表这个数据库档案的陈旧，序号越大，代表越新。当slave要判断是否主动下载新的数据库时，就以序号是否比slave上的还有新来判断。
4> 刷新频率（Refresh）。即slave向master要求数据更新的频率。
5> 失败重新尝试时间（Retry）。如果因为某些因素，导致slave无法对master达成联机，那么在多久的时间内，slave会尝试重新联机到master。
6> 失效时间（Expire）。如果一直失败尝试时间，持续联机到达这个设定值时限，那么slave将不再继续尝试联机。
7> 存活时间（Minimum TTL）。如果在这个数据库zone file中，每笔记录都没有显性设定TTL快取时间的话，那么就以这个值为主。
```

```tex
[名称] [TTL] [网络类型] 资源记录类型 数据
名称：指定资源记录引用的对象名，可以是主机名，也可以是域名。对象名可以是相对名称也可以是完整名称。完整名称必须以点结尾。如果连续的几条资源记录类型是同一个对象名，则第一条资源记录后的资源记录可以省略对象名。相对名称表示相对与当前域名来说的，如当前域名为shinefire.com，则表示www主机时，完整名称为www.shinefire.com.，相对名称为www。
TTL：指定资源记录存在缓存中的时间，单位为秒。如果该字段省略，则使用在文件开始出的$TTL所定义的时间。
网络类型：常用的为IN
资源记录类型：常用的有SOA、NS、A、PTR、MX、CNAME
在定义资源记录时，一般情况下是SOA记录为第一行，NS记录第二行，接着是MX记录，其他的记录可以随便写。
;：表示注释
()：允许数据跨行。通常用于SOA记录
@：表示当前域。根据主配置文件zone中所定义的区域名称。
*：用于名称字段的通配符。
$ORIGIN :ORIGIN后面跟上的是字符串，即要补全的内容。

IP地址的格式可以是如下的几种形式：
单一主机：x.x.x.x，如172.17.100.100
指定网段：x.x.x.或x.x.x.x/n，如172.17.100.或者是172.17.100.0/24
指定多个地址：x.x.x.xx.x.x.x如，172.17.100.100;172.17.100.200
使用!表示否定：如!172.17.100.100，则排除172.17.100.100
不匹配任何：none
匹配所有：any
本地主机（bind本机）：localhost
与bind主机同网段的所有IP地址：localnet
```

#### 修改DNS服务器地址

```bash
# vi /etc/resolv.conf 
# Generated by NetworkManager
search com shinefire.com
nameserver 192.168.31.228
```

### 配置反向解析

#### 修改配置文件





## 参考文献

- [Linux（RHEL7及CentOS7）下DNS服务器的搭建与配置](https://blog.csdn.net/solaraceboy/article/details/78960307)
- [CentOS 7 搭建企业内网 DNS 服务器](https://blog.csdn.net/devalone/article/details/80580094)

